archives/2024/Results/Verifications/S2427/bottleneck-determination/point_select/threads-12/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=12 oltp_point_select --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-ty
pe=uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 12
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 12 tps: 8891.71 qps: 8891.71 (r/w/o: 8891.71/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 12 tps: 8218.51 qps: 8218.51 (r/w/o: 8218.51/0.00/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 12 tps: 7543.58 qps: 7543.58 (r/w/o: 7543.58/0.00/0.00) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 12 tps: 6109.25 qps: 6109.25 (r/w/o: 6109.25/0.00/0.00) lat (ms,95%): 4.49 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 12 tps: 6887.75 qps: 6887.75 (r/w/o: 6887.75/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 12 tps: 8482.80 qps: 8482.80 (r/w/o: 8482.80/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 12 tps: 8518.74 qps: 8518.74 (r/w/o: 8518.74/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 12 tps: 8933.07 qps: 8933.07 (r/w/o: 8933.07/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 12 tps: 9109.60 qps: 9109.60 (r/w/o: 9109.60/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 12 tps: 8725.40 qps: 8725.40 (r/w/o: 8725.40/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            814257
        write:                           0
        other:                           0
        total:                           814257
    transactions:                        814257 (8141.81 per sec.)
    queries:                             814257 (8141.81 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0057s
    total number of events:              814257

Latency (ms):
         min:                                    0.68
         avg:                                    1.47
         max:                                  264.39
         95th percentile:                        2.91
         sum:                              1198517.83

Threads fairness:
    events (avg/stddev):           67854.7500/171.46
    execution time (avg/stddev):   99.8765/0.01


real    1m40.082s
user    0m16.895s
sys     0m31.361s